generic.text.aboutSecShep = Acerca de Security Shepherd
generic.text.admin = Admin
generic.text.cheat = Hacer trampas
generic.text.challenges = Desaf&iacute;os
generic.text.commentMessage.1 = Ahora mismo est&aacute;s mirando en el servidor central.
generic.text.commentMessage.2 = Aqu&iacute; no hay nada relacionado con los niveles de Security Shepherd.
generic.text.commentMessage.3 = Puede que estés buscando un iframe embebido en la p&aacute;gina.
generic.text.commentMessage.4 = Prueba una herramienta como Firebug para hacer esto m&aacute;s sencillo.
generic.text.configuration = Configuraci&oacute;n
generic.text.configureShepherd = Configurar Shepherd.
generic.text.confirmPasswd = Confirmar Password
generic.text.confirmEmailAddr = Confirmar email.
generic.text.emailAddr = Direcci&oacute;n de email.
generic.text.lessons = Lecciones
generic.text.login = Iniciar sesi&oacute;n
generic.text.logout = Cerrar sesi&oacute;n
generic.text.loading = Cargando...
generic.text.ssRegister = OWASP Security Shepherd - Registrarse
generic.text.password = Password
generic.text.pleaseWait = Por favor, espere.
generic.text.register = Registrarse
generic.text.scoreboard = Marcador
generic.text.searchModules = Buscar m&oacute;dulos
generic.text.shepherdVersion = Security Shepherd Version: 3.0
generic.text.sorryError = Lo sentimos, se ha producido un error.
generic.text.submitResult = Enviar clave soluci&oacute;n aqu&iacute;
generic.text.submit = Enviar
generic.text.username = Nombre de usuario
generic.text.welcome = Bienvenido

getter.button.completed = Completado
getter.button.nextChallenge = Cargar siguiente desaf&iacute;o
getter.button.finished = Has terminado!
getter.button.noModulesFound = No se encuentran m&oacute;dulos.
getter.tournamentRank.1 = Entrenamiento de campo.
getter.tournamentRank.2 = Soldado
getter.tournamentRank.3 = Cabo
getter.tournamentRank.4 = Sargento
getter.tournamentRank.5 = Teniente
getter.tournamentRank.6 = Comandante
getter.tournamentRank.7 = Almirante

getStarted.text.lets_start = Comencemos
getStarted.button.openLevels.all = Abrir todos los niveles
getStarted.button.openLevels.web = Abrir s&oacute;lo niveles de aplicaci&oacute;n web
getStarted.button.openLevels.mobile = Abrir s&oacute;lo niveles de aplicaci&oacute;n m&oacute;vil
getStarted.button.closeLevels = Cerrar todos los niveles
blockedMessage.text.heading.levelBlocked = Nivel bloqueado en estos momentos
index.link.admin.cheatSheet.manage = Gesti&oacute;n del solucionario
index.link.admin.cheatSheet.manage.create = Crear nuevo solucionario
index.link.admin.cheatSheet.manage.disable = Desactivar solucionarios
index.link.admin.cheatSheet.manage.enable = Activar solucionarios
index.link.admin.config.change = Cambiar la disposici&oacute;n de m&oacute;dulos
index.link.admin.config.feedback = Feedback de configuraci&oacute;n
index.link.admin.config.openClose = Abrir/Cerrar registro
index.link.admin.config.scoreboard = Configuraci&oacute;n del marcador
index.link.admin.config.coreDb = Establecer base de datos central.
index.link.admin.moduleManage = Gesti&oacute;n de m&oacute;dulos
index.link.admin.moduleManage.block = Configuraci&oacute;n de bloques de m&oacute;dulos
index.link.admin.moduleManage.openClose = Abrir y cerrar m&oacute;dulos
index.link.admin.moduleManage.openCloseCategory = Abrir o cerrar por categor&iacute;a
index.link.admin.moduleManage.feedback = Ver Feedback
index.link.admin.moduleManage.progress = Ver Progreso
index.link.admin.userMange = Gesti&oacute;n de usuarios
index.link.admin.userMange.addPlayer = Agregar usuarios
index.link.admin.userMange.addPoints = Sumar/restar puntos
index.link.admin.userMange.assignPlayer = Asignar jugadores a una clase
index.link.admin.userMange.createClass = crear clase
index.link.admin.userMange.createAdmin = Crear nuevo administrador
index.link.admin.userMange.resetPass = Reset Password
index.link.admin.userMange.setDefaultPlayerClass = Establecer la clase de los jugadores por defecto
index.link.admin.userMange.suspendPlayer = Suspender jugador
index.link.admin.userMange.unsuspendPlayer = Deshacer Suspender jugador
index.link.admin.userMange.upgradeToAdmin = Elevar privilegios de un jugador a administrador
login.text.sponsers = Patrocinadores del proyecto
readyToPlay.title.readyToPlay = Security Shepherd - Est&aacute;s listo?
readyToPlay.header.notReady = No est&aacute;s listo!
readyToPlay.title.enteredGame = Has entrado en el juego!
login.text.proxy_question = Necesitas un Proxy?
login.text.download_proxy = Descarga el proxy HTTP aqu&iacute;


login.link.zap_win = ZAP para Windows
login.link.zap_lin = ZAP para Linux
login.link.zap_mac = ZAP para Mac


blockedMessage.text.info.levelBlocked = Vas muy bien! Un administrador ha cerrado este nivel. Para saber cu&aacute;ndo se va a abrir este nivel, necesitas preguntar al responsable de la aplicaci&oacute;n!
getStarted.text.moduleInfo.openFloor = Ahora que te has registrado, vamos a comenzar con algunos m&oacute;dulos! Para comenzar un m&oacute;dulo, utiliza el men&uacute; lateral para seleccionar elementos de la lista de <span><a>Lecciones</a></span> o <span><a>M&oacute;dulos</a></span> para ver los m&oacute;dulos disponibles en estos momentos.
getStarted.text.moduleInfo.incrementalFloor = Ahora que te has registrado, vamos a comenzar con algunos desaf&iacute;os de Security Shepherd! Para empezar uno, haz click en el bot&oacute;n de la izquierda de &quot;Ir al siguiente desaf&iacute;!
getStarted.text.moduleInfo = Ahora que te has registrado, vamos a comenzar con algunos m&oacute;dulos!  Para comenzar un m&oacute;dulo, utiliza el men&uacute; lateral para seleccionar elementos como <span><a>Entrenamiento de campo</a></span> o <span><a>Cabo</a></span>, ipara ver los m&oacute;dulos disponibles en estos momentos! Cuanto m&aacute;s abajo de la lista aparezca, vale m&aacute;s puntos! 
getStarted.text.configureShepherd.asAnAdmin = Como administrador puedes cambiar el &aacute;mbito de Security Shepherd. Puedes cambiar de forma sencilla la disposici&oacute;n del juego a la aplicaci&oacute;n web o m&oacute;vil. enfocada con los siguientes botones, o puedes abrir el men&uacute; de administraci&oacute;n de m&oacute;dulos, en la parte superior izquierda, para abrir o cerrar elementos espec&iacute;ficos.
getStarted.text.checkShepConfigMsg = Si no puedes ver el mensaje debajo de este p&aacute;rrafo, por favor, comprueba que tu instancia de Security Shepherd est&aacute; configurada correctamente.
getStarted.text.info.changePassword = Tu password es un password temporal. Esto significa que alguien m&aacute;s lo conoce! Vamos a mantener las cosas seguras y cambiarlo ahora!
login.text.info = Usa tus <a><span>credenciales de Security Shepherd<span></a> para iniciar sesi&oacute;n.
login.text.regInfo = Reg&iacute;strate para crear una <a href="register.jsp"><span>cuenta de Security Shepherd</span></a> aqu&iacute;!
login.text.about_blurb = El OWASP Security Shepherd project ha sido dise&ntilde;ado e implementado con el prop&oacute;sito de fomentar y mejorar la conciencia de seguridad de aplicaciones software teniendo en cuenta un conjunto de habilidades variado.Este proyecto permite a los usuarios aprender y mejorar sus habilidades de test de pentesting manual. Esto se consigue mediante una t&eacute;cnica que combina lecciones y desaf&iacute;os. Una lecci&oacute;n proporciona al usuario mucha ayuda para completar un desaf&iacute;o, mientras que un desaf&iacute;o pone en pr&aacute;ctica los conocimientos aprendidos en una lecci&oacute;n. </p><p>El proyecto de OWASP Security Shepherd project cubre el OWASP Top 10 de riesgos de aplicaciones web y el OWASP top 10 de riesgos de aplicaciones m&oacute;viles. Utilizando estos riesgos como banco de pruebas, se pueden explorar las vulnerabilidades de seguridad m&aacute;s comunes, y su impacto en un sistema. Muchos de estos niveles incluyen una protecci&oacute;n o mitigaci&oacute;n insuficiente de estos riesgos como por ejemplo filtros de lista negra o 'blacklist', terriblemente malos esquemas de codificaci&oacute;n, esquemas de seguridad fatales y configuraciones de seguridad pobres. Los m&oacute;dulos se han creado no solo para proporcionar desaf&iacute;os a novatos en temas de seguridad sino tambi&eacute;n para profesionales del mundo de la seguridad.
login.text.sponsers_blurb = El  OWASP Security Shepherd project quiere agradecer y reconocer el generoso apoyo de nuestros patrocinadores. Por favor, echa un vistazo a sus webs y s&iacute;gueles en Twitter.
login.text.thanks = El  OWASP Security Shepherd Project tambi&eacute;n quiere agradecer al Dr. Anthony Keane y al laboratorio de investigaci&oacute;n de la ITB por su su hosting p&uacute;blico https://owasp.securityShepherd.eu 
readyToPlay.text.info.notReady = Actualiza la p&aacute;gina principal! Si este error contin&uacte;a, cierra la sesi&oacute;n e inicia de nuevo. Si el error sigue, por favor, contacta con un administrador.
readyToPlay.text.info.enteredGame = Ahora que puedes ver esto, todo est&aacute; listo para empezar!Comienza a completar lecciones y desaf&iacute;os!<br/><br/>Recureda, cada nivel en el que juegas es una sub-aplicaci&oacute;n.  Mant&eacute;n el juego en estas aplicaciones! Mant&eacute;nte alejado de tus identificadores de sesi&oacute;n de la aplicaci&oacute;n principal; s&oacute;lo conseguir&aacute;s cerrar tu propia sesi&oacute;n si los cambias.<br/><br/> Si aun no has configurado un proxy web, deber&iacute;as hacerlo, simplifica mucho las cosas!

sponsorship.title = Patrocinadores del proyecto
sponsorship.message.1 = El  OWASP Security Shepherd project quiere agradecer y reconocer el generoso apoyo de nuestros patrocinadores. Por favor, echa un vistazo a sus webs y s&iacute;gueles en Twitter.
sponsorship.message.2 = El  OWASP Security Shepherd Project tambi&eacute;n quiere agradecer al Dr. Anthony Keane y al laboratorio de investigaci&oacute;n de la ITB por su su hosting p&uacute;blico https://owasp.securityShepherd.eu
