generic.text.aboutSecShep = \u5927\u7EA6 Security Shepherd
generic.text.admin = \u7BA1\u7406\u5458
generic.text.cheat = \u9A97\u5B50
generic.text.challenges = \u6311\u6218
generic.text.commentMessage.1 = You are currently looking at the core server. (Translation Required)
generic.text.commentMessage.2 = Nothing related to the levels in Security Shepherd will be found in here. (Translation Required)
generic.text.commentMessage.3 = You might be looking for the iframe embedded in the page. (Translation Required)
generic.text.commentMessage.4 = Try a tool like Firebug to make this stuff easier. (Translation Required)
generic.text.configuration = \u6784\u9020
generic.text.configureShepherd = \u914D\u7F6E Shepherd
generic.text.confirmPasswd = \u786E\u8BA4\u5BC6\u7801
generic.text.confirmEmailAddr = \u786E\u8BA4\u7535\u5B50\u90AE\u4EF6
generic.text.emailAddr = \u7535\u5B50\u90AE\u4EF6\u5730\u5740
generic.text.lessons = \u6559\u8BAD
generic.text.login = \u767B\u9646
generic.text.logout = \u767B\u51FA
generic.text.loading = \u8F7D\u5165\u4E2D...
generic.text.ssRegister = OWASP Security Shepherd - \u6CE8\u518C
generic.text.password = \u5BC6\u7801
generic.text.pleaseWait = \u8BF7\u7A0D\u5019
generic.text.register = \u6CE8\u518C
generic.text.scoreboard = \u8BB0\u5206\u677F
generic.text.searchModules = Search Modules (Translation Required)
generic.text.shepherdVersion = Security Shepherd Version: 2.4 (Translation Required)
generic.text.sorryError = Sorry but there was an error (Translation Required)
generic.text.submitResult = Submit Result Key Here (Translation Required)
generic.text.submit = \u767B\u9646
generic.text.username = \u7528\u6237\u540D
generic.text.welcome = \u6B22\u8FCE

login.text.info = \u7528\u4F60\u7684 <a><span>Security Shepherd \u8BC1\u4E66<span></a> \u767B\u9646.
login.text.regInfo = \u6CE8\u518C\u4E00\u4E2A <a href="register.jsp"><span>Security Shepherd \u5E10\u6237</span></a> \u8FD9\u91CC!
login.text.proxy_question = \u4F60\u9700\u8981\u4E00\u4E2A\u4EE3\u7406?
login.text.about_blurb = OWASP\u7684\u5b89\u5168\u7267\u7f8a\u4eba\u9879\u76ee\u7684\u8bbe\u8ba1\u548c\u7528\u57f9\u517b\u548c\u63d0\u9ad8\u4e2d\u5404\u79cd\u4e0d\u540c\u7684\u6280\u80fd\u7ec4\u5408\u4eba\u53e3\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u5b89\u5168\u6027\u610f\u8bc6\u7684\u76ee\u6807\u5b9e\u73b0\u3002\u8be5\u9879\u76ee\u4f7f\u7528\u6237\u80fd\u591f\u5b66\u4e60\u6216\u6539\u5584\u73b0\u6709\u65f6\u624b\u52a8\u6e17\u900f\u6d4b\u8bd5\u6280\u80fd\u3002\u8fd9\u662f\u901a\u8fc7\u6559\u8bad\u548c\u6311\u6218\u6280\u672f\u6765\u5b8c\u6210\u3002\u4e00\u8282\u8bfe\u63d0\u4f9b\u4e86\u5927\u91cf\u7684\u5b8c\u6210\u8be5\u6a21\u5757\uff0c\u5176\u4e2d\u4e00\u4e2a\u6311\u6218\u4f7f\u7528\u6237\u5728\u8bfe\u5b66\u4f1a\u4e86\u4f7f\u7528\u54ea\u4e9b\u5e2e\u52a9\u7528\u6237\u3002 </ p> <p>\u5728OWASP\u5b89\u5168\u7267\u7f8a\u4eba\u9879\u76ee\u6db5\u76d6OWASP\u5341\u5927Web\u5e94\u7528\u7a0b\u5e8f\u7684\u98ce\u9669\uff0c\u4e5f\u6db5\u76d6\u4e86OWASP\u5341\u5927\u79fb\u52a8\u98ce\u9669\u4e3a\u597d\u3002\u4f7f\u7528\u8fd9\u4e9b\u98ce\u9669\u662f\u4e00\u4e2a\u6311\u6218\u8bd5\u9a8c\u53f0\uff0c\u5e38\u89c1\u7684\u5b89\u5168\u6f0f\u6d1e\u53ef\u4ee5\u88ab\u63a2\u7d22\u548c\u4ed6\u4eec\u7684\u7cfb\u7edf\u4e0a\u7684\u5f71\u54cd\u7684\u7406\u89e3\u3002\u8bb8\u591a\u5c42\u9762\u5305\u62ec\u7f13\u89e3\u4e0d\u8db3\u548c\u4fdd\u62a4\u8fd9\u4e9b\u98ce\u9669\uff0c\u5982\u9ed1\u540d\u5355\u8fc7\u6ee4\u5668\uff0c\u6b8b\u66b4\u7684\u7f16\u7801\u65b9\u6848\uff0c\u91ce\u86ee\u7684\u5b89\u5168\u673a\u5236\u548c\u5b89\u5168\u914d\u7f6e\u8f83\u5dee\u3002\u8be5\u6a21\u5757\u5df2\u7ecf\u5236\u4f5c\u4e0d\u4ec5\u63d0\u4f9b\u4e86\u4e00\u4e2a\u5b89\u5168\u7684\u65b0\u624b\u6765\u8bf4\u662f\u4e00\u4e2a\u6311\u6218\uff0c\u4f46\u5b89\u5168\u4e13\u5bb6\u4e3a\u597d\u3002
login.text.download_proxy = \u5728\u8fd9\u91cc\u4e0b\u8f7dHTTP\u4ee3\u7406
login.text.zap_win = ZAP \u4E3A Windows
login.text.zap_lin = ZAP \u4E3A Linux
login.text.zap_mac = ZAP \u4E3A Mac
login.text.sponsers = \u9879\u76EE\u8D5E\u52A9\u5546
login.text.sponsers_blurb = : \u8BE5\u9879\u76EE OWASP Security Shepherd \u613F\u627F\u8BA4\u5E76\u611F\u8C22\u6177\u6168\u652F\u6301\u6211\u4EEC\u7684\u8D5E\u52A9\u5546\u8BF7\u68C0\u67E5\u81EA\u5DF1\u7684\u7F51\u9875\u5E76\u6309\u7167\u4ED6\u4EEC\u7684 Twitter \u7684
login.text.thanks = : \u8BE5\u9879\u76EE OWASP Security Shepherd \u8FD8\u8981\u611F\u8C22 Dr. Anthony Keane \u548C ITB \u5B89\u5168\u7814\u7A76\u5B9E\u9A8C\u5BA4\u4E3B\u529E\u7684\u516C\u4F17" https://owasp.securityShepherd.eu
getStarted.text.lets_start = \u8BA9\u6211\u4EEC\u5F00\u59CB\u5427

index.button.configuration = \u7EC4\u6001