challenge.intro = Para completar ese desaf&iacute;o, debes conseguir que tu contador CSRF marque m&aacute;s de 0. Una vez la petici&oacute;n de incrementar tu contador es como sigue;
challenge.withThisParameter = Con el siguiente par&aacute;metro;
challenge.withTheseParameters = Con los siguientes par&aacute;metros;
challenge.inJson = Con el cuerpo de la petici&oacute;n (Formado en JSON);
challenge.userIdExample = exampleId
challenge.userTokenExample = exampleToken
challenge.yourCsrfTokenCamelCase = yourCsrfToken
challenge.csrfTokenGenerated = El par&aacute;metro csrfToken se genera din&aacute;micamente para cada usuario con la interacci&oacute;n del usuario con la petici&oacute;n descrita arriba.
challenge.getCsrfTokenHere.1 = Puedes recuperar tu token CSRF
challenge.getCsrfTokenHere.2 = aqu&iacute;
challenge.whereIdIsUserBeenIncremented.1 = Donde
challenge.whereIdIsUserBeenIncremented.2 = est&aacute; el ID del usuario cuyo contador CSRF se incrementa.
challenge.yourIdIs = Tu ID es
challenge.yourIdIs.1 = . Cualquier usuario al que puedas incrementar el contador para este desaf&iacute;o, excepto t&uacute;. Explota la vulnerabilidad CSRF en la petici&oacute;n descita arriba contra otros usuarios para completar este desaf&iacute;. Una vez que hayas hecho CSRF a otro usuario de Security Shepherd, la clave soluci&oacute;n aparecer&aacute; justo debajo de este mensaje.
challenge.yourCsrfTokenIs = y tu token CSRF es
challenge.useForumForImg = Puedes usar el foro CSRF de abajo para dejar un mensaje con una imagen.
challenge.useForumForIframe = Puedes usar el foro CSRF de abajo para publicar un mensaje con una p&aacute;gina HTML.
challenge.firstUser.get = Si eres la primera persona en llegar hasta aqu&iacute;, tendr&aacute;s que forzar a otro jugador a enviar una petici&oacute;n GET de alguna otra manera!
challenge.firstUser.post = Si eres la primera persona en llegar hasta aqu&iacute;, tendr&aacute;s que forzar a otro jugador a enviar una petici&oacute;n POST de alguna otra manera!

result.congratsTheKeyIs = Enhorabuena, has completado este desaf&iacute;o CSRF llevando a cabo un ataque CSRF satisfactoriamente contra otro usuario para el objetivo de este nivel. La clave soluci&oacute;n es
result.challengeCompleted = Este desaf&iacute;o CSRF ha sido completado.

forum.img.whatToDo = Por favor, introuce la <a>imagen</a> que quieres compartir con tu clase
forum.iframe.whatToDo = Por favor, introduce la p&aacute;gina HTML que quieres compartir con tu clase
forum.postMessage = Publicar mensaje
forum.loading = Cargando...
forum.userName = Nombre de usuario
forum.image = Imagen
forum.message = Mensaje

error.occurred = Ha ocurrido un error
error.noClass = Debes estar asignado a una clase para usar esta funcionalidad. Por favor, ponte en contacto con el administrador.
error.noToken = Fue imposible recuperar el token CSRF. Funky


title.csrf1 = Cross Site Request Forgery Desaf&iacute;o 1
title.csrf2 = Cross Site Request Forgery Desaf&iacute;o 2
title.csrf3 = Cross Site Request Forgery Desaf&iacute;o 3
title.csrf4 = CSRF Desaf&iacute;o 4
title.csrf5 = CSRF Desaf&iacute;o 5
title.csrf6 = Cross Site Request Forgery Desaf&iacute;o 6
title.csrf7 = CSRF Desaf&iacute;o 7
title.csrfJson = CSRF Desaf&iacute;o JSON